app/controllers/talks_controller.rb

  def index
    @talks = Talk.all
---
SELECT "talks".* FROM "talks"

  def show
    @talk = Talk.find(params[:id])
---
SELECT "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT 1  [["id", "2"]]

  def edit
    @talk = Talk.find(params[:id])
---
SELECT "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT 1  [["id", "3"]]

  def create
    @talk = Talk.new(params[:talk])

    respond_to do |format|
      if @talk.save
---
INSERT INTO "talks" ("created_at", "description", "email", "name", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Thu, 17 Nov 2011 01:13:05 UTC +00:00], ["description", nil], ["email", nil], ["name", nil], ["title", nil], ["updated_at", Thu, 17 Nov 2011 01:13:05 UTC +00:00]]

  def update
    @talk = Talk.find(params[:id])
---
SELECT "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT 1  [["id", "7"]]

  def destroy
    @talk = Talk.find(params[:id])
    @talk.destroy
---
SELECT "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT 1  [["id", "12"]]
DELETE FROM "talks" WHERE "talks"."id" = $1  [["id", 12]]